package lesson3

/**
 * @author : Mingaleev D
(gitHub -> Mingaleev-D92)
 * @data : 21/12/2022
 */

/**
Надеюсь правильно понял задачу.У меня просто появляются
вопросы типо как то же нужно определить когда какое приветствие выводить.
Мне показалось задача непонятной.Наверное это все не важно мы просто наверное выводим с начало
одно приветствие а потом другое.
 Во общем если без лишних вопросов то тут все просто и понято
 */


fun main() {

   var greetings = "дневное"
   val userName = "userName"
   println("$greetings приветствие $userName")

   greetings = "вечернее"
   println("$greetings приветствие $userName")
}
