package lesson1

/**
 * @author : Mingaleev D
(gitHub -> Mingaleev-D92)
 * @data : 21/12/2022
 */

/**
Ну вот началось! Первый раз полез в гугл так как не помню сколько что хранит
Думаю, с этого момент "гугл в помощь" станет мне знакомым очень хорошо.
Осталось правильно научиться гуглить с этим есть проблемы.Надеюсь с этим мне помогут))
Ах задача. Не сложная простое понимание простых вещей.
Это не лямды которую я пока до сих пор понять не могу не знаю))))

 */

fun main() {

   val length: Long = 40_868_600_000
   val age: Byte = 27
   val partOfDay: Float = 0.075F
   val seconds: Short = 6480
   val partOfYear: Double = 2.0547945205479453E-4
   val apogee: Int = 327000

   println(
      """
      Расстояние $length
      Возраст – $age
      Часть дня – $partOfDay
      Секунды – $seconds
      Часть года – $partOfYear
      Апогей орбиты – $apogee
   """.trimIndent()
   )
}