package lesson2

/**
 * @author : Mingaleev D
(gitHub -> Mingaleev-D92)
 * @data : 21/12/2022
 */

/**
В данной задаче ничего сложно нет, НО опять же спасибо за пояснения
Не знаю сколько бы я делал ее без.
Мне было бы интересно если задачи будут так чередоваться тип 1,2 изи 3 тяжелая
4 норм а 5 сверх хард, то так будет интересно))
Во общем задача не плохая мне понравилась
Сейчас обнаружил что 5 задачи нет.
Значит так мне понравилось(если сравнивать со всеми задачами) чутка попотел только над 3 задачей
Я бы оценил все на 4.7(я оцениваю по 5 шкале)
Почему не 5 потому что не хочу перехвалить, но и меньше поставить не могу так как мне понравилось
 СПАСИБО!
 */

fun main() {

   val oreCrystal = 7
   val oreIron = 11
   val bustBuffOfPercent = 5

   println("С баффом Вы бы на ${oreCrystal / bustBuffOfPercent} больше добыли кристаллической руды больше")
   println("С баффом Вы бы на ${oreIron / bustBuffOfPercent} больше добыли железной руды больше")
}
